CREATE TABLE shop (
                      id SERIAL PRIMARY KEY,
                      name VARCHAR(100) NOT NULL,
                      address VARCHAR(255),
                      phone VARCHAR(20),
                      email VARCHAR(100),
                      website VARCHAR(100),
                      category VARCHAR(50),
                      description TEXT
);
INSERT INTO shops (name, address, phone, email, website, category, description) VALUES
        ('Магазин №1', 'ул Володимирська, 19а', '123-456-7890', 'shop1@example.com', 'http://shop1.com', 'Продовольственный', 'Один из лучших магазинов.'),
        ('Магазин №2', 'ул Софіївська, 25, Київ, Украина, 02000', '987-654-3210', 'shop2@example.com', 'http://shop2.com', 'Спортивный', 'Магазин спортивного инвентаря.'),
        ('Магазин №3', 'ул. Олеся Гончара, 51', '555-555-5555', 'shop3@example.com', 'http://shop3.com', 'Господарственный', 'Магазин товаров для дома.');
('Магазин №1', 'ул Володимирська, 19а', '123-456-7890', 'shop1@example.com', 'http://shop1.com', 'Продовольственный', 'Один из лучших магазинов.'),
        ('Магазин №2', 'ул Софіївська, 25, Київ, Украина, 02000', '987-654-3210', 'shop2@example.com', 'http://shop2.com', 'Спортивный', 'Магазин спортивного инвентаря.'),
        ('Магазин №3', 'ул. Олеся Гончара, 51', '555-555-5555', 'shop3@example.com', 'http://shop3.com', 'Господарственный', 'Магазин товаров для дома.');
('Магазин №1', 'ул Володимирська, 19а', '123-456-7890', 'shop1@example.com', 'http://shop1.com', 'Продовольственный', 'Один из лучших магазинов.'),
        ('Магазин №2', 'ул Софіївська, 25, Київ, Украина, 02000', '987-654-3210', 'shop2@example.com', 'http://shop2.com', 'Спортивный', 'Магазин спортивного инвентаря.'),
        ('Магазин №3', 'ул. Олеся Гончара, 51', '555-555-5555', 'shop3@example.com', 'http://shop3.com', 'Господарственный', 'Магазин товаров для дома.');
('Магазин №1', 'ул Володимирська, 19а', '123-456-7890', 'shop1@example.com', 'http://shop1.com', 'Продовольственный', 'Один из лучших магазинов.'),
        ('Магазин №2', 'ул Софіївська, 25, Київ, Украина, 02000', '987-654-3210', 'shop2@example.com', 'http://shop2.com', 'Спортивный', 'Магазин спортивного инвентаря.'),
        ('Магазин №3', 'ул. Олеся Гончара, 51', '555-555-5555', 'shop3@example.com', 'http://shop3.com', 'Господарственный', 'Магазин товаров для дома.');
